XMegaForArduino/arduino/variants/xmega128a4u/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA

  Updated for 'xmega' core by bob frazier, S.F.T. Inc. - http://mrp3.com/

  X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A

  The xmega code mods make a considerable number of assumptions
  about the pin number assignments (as defined here):


  SPI is assumed to be on PORTC (pins 4-7)
  USB is assumed to be on PORTD (pins 6-7) (this eliminates using SPI on port D)
  Serial1 is implemented on PORTD (USARTD0), Serial2 and Serial3 on PORTC
  Serial1 and Serial2 use pins 2,3; Serial3 uses pins 6,7.  No flow control is assigned
  PORTR pins 0 and 1 are the RX and TX LEDs.  Pin D13 (PC7) is the 'built-in' LED, defined
  as 'LED_BUILTIN', and is active HIGH.

  Your Mileage May Vary, depending on your board layout.  Some boards shift the
  digital pin assignments by 2 so that digital I/O pin 0 is PORTD Rx, pin 13 is PORTC SCK, just
  like the Arduino ATmega board.  Then they align the physical pins so that a regular Arduino shield
  will work, and assign PORTD 0-1 to 2 different digital I/O pin numbers (such as 20 and 21).

  To facilitate that specific change, uncomment the #define for 'DIGITAL_IO_PIN_SHIFT', below.
  Alternately you can create a separate version of this file with a different variant name,
  such as 'xmega-compat', with the #define uncommented, stored in an appropriately named directory.

  ============================
  HARDWARE SERIAL FLOW CONTROL
  ============================

  This version of the xmega Arduino startup+support files supports HARDWARE FLOW CONTROL on BOTH serial ports via
  RTS (output) and CTS (input).  CTS is implemented as input from remote device's DTR.  RTS is implemented as DTR output.

  To implement RTS/CTS, use definitions similar to the following in your version of this header file

  NOTE: RTS(DTR) will be configured as an output, active low (high tells sender to stop sending data to the UART)
        CTS will be configured as an input, active low (high stops data from being sent out via UART)

  CTS high to low transition causes an interrupt that may result in serial I/O (for faster response time).

  // RTS(DTR) as GPIO 0 (port D pin 0)
  #define SERIAL_0_RTS_PORT_NAME PORTD
  #define SERIAL_0_RTS_PIN_INDEX 0

  // CTS as GPIO 1 (port D pin 1)
  #define SERIAL_0_CTS_PORT_NAME PORTD
  #define SERIAL_0_CTS_PIN_INDEX 1

  use similar definitions for serial 1, aka 'SERIAL_1_CTS_PORT'

  NOTE:  you can even use PORTA or PORTB pins for this, if you don't need to measure analog volts on those pins

  X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A

*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

// ---------------------------
// DEFAULT 2-WIRE PORT IS TWIC
// ---------------------------
#define USE_TWIC /* define this to re-map TWIC to digital pins 20 and 21, similar to an Arduino Mega2560.  requires DIGITAL_IO_PIN_SHIFT */

#if !defined(USE_TWIC) && !defined (USE_TWIE) /* if neither USE_TWIC nor USE_TWIE defined */
#define USE_TWIE /* if neither is defined, as in I comment the above line, define 'USE_TWIE' */
#endif // !defined(USE_TWIC) && !defined (USE_TWIE)

#define NUM_DIGITAL_PINS            20
#define NUM_ANALOG_INPUTS           12
#define analogInputToDigitalPin(p)  ((p < 12) ? (p) + 22 : -1)
#define digitalPinHasPWM(p)         ((p) < 16 || (p) == 18 || (p) == 19) /* PORTC pins 0 and 1 are 20 and 21, respectively */


// this returns the DEFAULT INTERRUPT (in this case, interrupt 0) for any digital or analog pin
// If you choose a port's pin 2, it will be the same as using 'PORTn_INT0'
#define digitalPinToInterrupt(p) \
  ( pgm_read_byte(&port_to_int0_PGM[pgm_read_byte(&digital_pin_to_port_PGM[p])]) | \
    ( ((pgm_read_byte(&digital_pin_to_bit_mask_PGM[p]) - 2) & 7) << 5 ) )



//////////////////////////////////////////////////////////////////////////////
//                                                                          //
//                            _   _  ____   ____                            //
//                           | | | |/ ___| | __ )                           //
//                           | | | |\___ \ |  _ \                           //
//                           | |_| | ___) || |_) |                          //
//                            \___/ |____/ |____/                           //
//                                                                          //
//                                                                          //
//////////////////////////////////////////////////////////////////////////////
//                                                                          //
// USB support code and definitions go here.  This affects a lot of things  //
// This file is otherwise identical to the non-u-suffix version.            //
//                                                                          //
// The USB Vendor and Product ID values are for the Arduino Mega 2560       //
//     DO! NOT! USE! THEM! OUTSIDE! OF! PERSONAL! EXPERIMENTATION!          //
// In particular, do NOT distribute ANY products or firmware using them!    //
// The ONLY reason they are here is so that your device will actually WORK  //
// when you plug it in (assuming you have a driver for the Mega 2560)       //
//                                                                          //
// If you need a FREE USB Vendor/Product ID set, you can visit THIS site:   //
//   http://wiki.openmoko.org/wiki/USB_Product_IDs                          //
//                                                                          //
// Or you can use one of the IDs specified here (restrictions apply):       //
//   https://github.com/arduino/ArduinoISP/                                 //
//     file: usbdrv/USB-IDs-for-free.txt                                    //
//                                                                          //
//////////////////////////////////////////////////////////////////////////////

#define USBCON /* says I have a USB controller, modifies startup code and default serial port accordingly */

// if there are no boards.txt entries for the USB VID or PID, they'll be defined as 'null'
#ifdef USB_VID
#if USB_VID==null
#undef USB_VID
#endif // USB_VID==null
#endif // USB_VID

#ifdef USB_PID
#if USB_PID==null
#undef USB_PID
#endif // USB_PID==null
#endif // USB_PID

#ifndef USB_VID
// NOTE:  you can eliminate the warnings by making a copy of this for your own variant
//        but REMEMBER! YOU! MUST! CHANGE! THE! IDS!

#warning using Arduino Mega2560 USB Vendor ID - do NOT ship product with these IDs
#define USB_VID 0x2341 /* this is the Arduino vendor ID - you should probably get your own */
#warning using Arduino Mega2560 USB Vendor ID - do NOT ship product with these IDs
#endif // USB_VID

#ifndef USB_PID
// NOTE:  you can eliminate the warnings by making a copy of this for your own variant
//        but REMEMBER! YOU! MUST! CHANGE! THE! IDS!

