XMegaForArduino/arduino/variants/xmega128a4u/pins_arduino.h
#warning using Arduino Mega2560 USB Product ID - do NOT ship product with these IDs
#define USB_PID 0x0010 /* this is the Arduino Mega2560 R3 product ID - you should probably use your own */
#warning using Arduino Mega2560 USB Product ID - do NOT ship product with these IDs
#endif // USB_PID

#define CDC_ENABLED    /* this switches to device class 2, useful for serial I/O implementations */



// xmega-specific - Interrupt 'vector number' assignments:

// Interrupts are PORT-SPECIFIC, not pin specific.
// pin 2 on any port is always asynchronous (except for 'R' which doesn't have a pin 2)
// all other pins can manage synchronous interrupts.  'wakeup' from sleep mode
// and other async interrupts must be on a 'pin 2', on ports A through E
//
// Each port has 2 separate interrupt vectors.  They can be assigned different pins.
// The same pin can also be assigned to both vectors on the same port, if desired.

#define PORTD_INT0  0
#define PORTD_INT1  1
#define PORTC_INT0  2
#define PORTC_INT1  3
#define PORTE_INT0  4
#define PORTE_INT1  5
#define PORTA_INT0  6
#define PORTA_INT1  7
#define PORTB_INT0  8
#define PORTB_INT1  9
#define PORTR_INT0  10
#define PORTR_INT1  11

#define EXTERNAL_NUM_INTERRUPTS 12 /* defined here instead of wiring_private.h - max value is 32 */

// was in wiring_external.h, moved here
#define EXTERNAL_INT_0  0
#define EXTERNAL_INT_1  1
#define EXTERNAL_INT_2  2
#define EXTERNAL_INT_3  3
#define EXTERNAL_INT_4  4
#define EXTERNAL_INT_5  5
#define EXTERNAL_INT_6  6
#define EXTERNAL_INT_7  7
#define EXTERNAL_INT_8  8
#define EXTERNAL_INT_9  9
#define EXTERNAL_INT_10 10
#define EXTERNAL_INT_11 11

// xmega 'A4' series has 4 sets of UART, and 2 sets of SPI.
// The 'A4U' series has USB on Port D pins PD6-7 (so USARTD1 cannot be used)
// The default UART is assigned on Port D, pins PD2-3
// The default SPI is assigned on Port C, pins PC4-7
//
// Also there are multiple 2-wire ports, the default being assigned to PC0-1
// see definition for DEFAULT_TWI and USE_TWIC
//
// GPIO pins are assigned as follows:
// PD2-5 Digital 0-3
// PE2-3 Digital 4-5 (this provides an async interrupt on 4)
// PD0-1 Digital 6-7
// PC2-7 Digital 8-13 (so SPI shows up on 10-13)
// PE0-1 digital 14-15 (for TWIE)
// PR0-1 digital 16-17 (RX LED on 16, TX LED on 17)
// PC0-1 digital 18-19 (for TWIC)
// PD6-7 USB D-, D+
// PA0-7 analog A0-A7
// PB0-3 analog A8-A11
//
// These assignments are primarily for 'Arduino Uno' pin mapping compatibility, to
// limit the things that need to be re-assigned for an xmega.
//
// '#define'ing USE_TWIC puts PC0-1 on 18-19 (corresponding to TWI pins on later Arduinos)
// '#define'ing USE_TWIE puts PE0-1 on 18-19 (and PC0-1 on 14-15)
//
//
// ALL PORT REMAP registers must be assigned to 0 (default mappings for pins)
// this puts PWM output on pins 0-3 for PORT E (the timers are split for C and D)
// Additionally, CLKOUT should be 0 (no clock outputs on any port/pin).
//
// TIMERS
// Timer 0 should be configured as 'Tx2' (for 8 PWM outputs) by default, essentially
// as a dual 8-bit timer, more or less compatible with the Arduino's 3 timers and
// supporting all 8 pins on ports C and D for PWM output.  Port C's timer supports
// the system clock.
//
// See 'AU' manual chapter 13 (I/O ports) for more on this


// ------------------------------------------
// DEFINITIONS FOR SERIAL PORTS AND TWI PORTS
// ------------------------------------------


// TWI ports
#define DEFAULT_TWI TWIC /* note see definitions for SDA and SCL, below - alter accordingly */

// the XMega64D4 has two TWI ports
#define TWI_PORT0 TWIC
#define TWI_VECTOR_S0 TWIC_TWIS_vect
#define TWI_VECTOR_M0 TWIC_TWIM_vect
#define TWI_PORT1 TWIE
#define TWI_VECTOR_S1 TWIE_TWIS_vect
#define TWI_VECTOR_M1 TWIE_TWIM_vect

#define TWI_INTERFACE_COUNT 2


// obsolete - consider removal in all of them
//#define TWIC_VECT_ENABLE /* use this to select the correct interrupt vectors for default */


// serial port 0
#define SERIAL_0_PORT_NAME PORTD
#define SERIAL_0_USART_NAME USARTD0
#define SERIAL_0_USART_DATA USARTD0_DATA
#define SERIAL_0_RXC_ISR ISR(USARTD0_RXC_vect)
#define SERIAL_0_DRE_ISR ISR(USARTD0_DRE_vect)
//#define SERIAL_0_REMAP PORTD_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 0 */
#define SERIAL_0_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_0_REMAP is defined */
#define SERIAL_0_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_0_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTD0_VECTOR_EXISTS

// serial port 1
#define SERIAL_1_PORT_NAME PORTC
#define SERIAL_1_USART_NAME USARTC0
#define SERIAL_1_USART_DATA USARTC0_DATA
#define SERIAL_1_RXC_ISR ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR ISR(USARTC0_DRE_vect)
#define SERIAL_1_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_1_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTC0_VECTOR_EXISTS

// serial port 2
#define SERIAL_2_PORT_NAME PORTC
#define SERIAL_2_USART_NAME USARTC1
#define SERIAL_2_USART_DATA USARTC1_DATA
#define SERIAL_2_RXC_ISR ISR(USARTC1_RXC_vect)
#define SERIAL_2_DRE_ISR ISR(USARTC1_DRE_vect)
#define SERIAL_2_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_2_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
#define USARTC1_VECTOR_EXISTS


// For atmega/Arduino shield compatibility, a typical board/pin layout might be as follows:
//
// NOTE:  this design/layout assumes USE_TWIC is defined, so TWI is on TWIC (port C pins 0/1)
//        and the 'Rev 3' pins for SDA/SCL are connected to PC0,1 respectively
//
//
//               M M
//             S I O   T R
//         A   C S S S x x
//     S S R G K O I S 2 2              T R
//     C D E N 1 1 1 1                  x x
//     L A F D 3 2 1 0 9 8  7 6 5 4 3 2 1 0
// ----o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o----
//     P P P   P P P P P P  P P P P P P P P
//     C C A   C C C C C C  D D E E D D D D
//     1 0 0   7 6 5 4 3 2  1 0 3 2 5 4 3 2
//
//
//               T O P   V I E W
//
//
//               3   3       V  P P P P P P
//               V   V 5     i  A A A A A A
//               3   3 V     n  6 5 4 3 2 1
// ------------o-o-o-o-o-o-o-o--o-o-o-o-o-o----
//             G I R 3 5 G G V  A A A A A A
//             N O E . V N N i  5 4 3 2 1 0
//             D R S 3   D D n
//               E E V
//               F T
//
// As with the MEGA2560 and other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.
// There should be 3 LED's:  RX on PR0, TX on PR1, and BUILTIN on PC7 (D13)
//
// 'USB-' is on PD6, and 'USB+' on PD7. Each should have a series 22 ohm resistor.
// TWIE is on PE0 and PE1, and should be broken out separately.
// AREF should be internally connected to Vcc (3.3v) through a 2.2k resistor.
//
//
//             ARDUINO REV 3 SHIELD LAYOUT and 3.3v SHIELD COMPATIBILITY
//             ---------------------------------------------------------
// This layout is based on the 'Rev 3' Arduino, with extra pins for IOREF and SDA/SCL.
// Note that SDA2/SCL2 is on PE0,1 respectively.  Both are exposed on pins NOT present
// on earlier Arduino shields.  But then again, earlier shields didn't have IOREF which
// is needed for 3.3v/5v shield compatibility.  So if you have a 3.3v compatible shield
// with the IOREF pin and extra pins for SDA,SCL you should be good to go.  But earlier
// shields may not work properly.
//
//                      COMPATIBLE ANALOG INPUTS ON PORT A ONLY
//                      ---------------------------------------
// Analog inputs use PA1 through PA6.  Only port A can use diff with gain against
// Vcc/2 as a reference; however, this is the default for compatibility reasons.  The
// 'AREF' pin is connected to PA0.  It can be selected using 'analogReference()'.
//
// PB0-3 can still be exposed separately, but they must use AREF (they won't work with
// the same 'hack' used for A1-7 using diff input with gain on internal Vcc/2).
//
// NOTE:  it is possible to use PB0 as an AREF. For now, PA0 is connected to AREF.
//
// NOTE -  AREF is a bit of an issue on xmega because it DOES! NOT! WORK! THE! SAME!
// as it does on the ATmegaXXX and so you need to (literally) steal one of the
// additional analog input pins to implement it, and for things to work right, it
// needs to be either PA0 or PB0 (because only they can be AREF).  The D4 processor
// handles these a bit better, but D4 doesn't have a USB...
//



