XMegaForArduino/arduino/variants/xmega128a4u/pins_arduino.h
// I/O pins (atmega compatibility) - see xmega mod description in comment at top

// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

// secondary SPI on PD4-7
static const uint8_t SS1   = 2;
static const uint8_t MOSI1 = 3;
static const uint8_t MISO1 = 4;
static const uint8_t SCK1  = 5;

// default 2-wire on PC0,PC1 - TWIC [note if I use TWIE, it's shifted around to the same pins]
static const uint8_t SDA = 18;
static const uint8_t SCL = 19;

// PD2-5 Digital 0-3
// PE2-3 Digital 4-5 (this provides an async interrupt on 4)
// PD0-1 Digital 6-7
// PC2-7 Digital 8-13 (so SPI shows up on 10-13; LED_BUILTIN also on 13)
// PE0-1 digital 14-15 (for TWIE)
// PR0-1 digital 16-17 (RX LED on 16, TX LED on 17)
// PC0-1 digital 18-19 (for TWIC)
// PD6-7 USB D-, D+ (in that order)
// PA0   AREF (connect with a 2.2k resistor to Vcc)
// PA1-7 analog A0-A6
// PB0-3 analog A7-A10


// port-specific 2-wire
#ifdef USE_TWIC
static const uint8_t SDA0 = 18;
static const uint8_t SCL0 = 19;
static const uint8_t SDA1 = 14;
static const uint8_t SCL1 = 15;
#else // !USE_TWIC, assume TWIE
static const uint8_t SDA0 = 14;
static const uint8_t SCL0 = 15;
static const uint8_t SDA1 = 18;
static const uint8_t SCL1 = 19;
#endif // USE_TWIC


// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6
#define PR0 16 /* RX LED */
#define PR1 17 /* TX LED */


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = 13;
#define LED_BUILTIN 13 /* Arduino >=1.06 uses #define, not a const uint8_t */

// NOTE:  TX LED is PR1, RX LED is PR0 - these next definitions are for USBCore.cpp
#define TX_RX_LED_INIT() { pinMode(PR0,OUTPUT); pinMode(PR1,OUTPUT); \
                           digitalWrite(PR0,0); digitalWrite(PR1,0); }
#define TXLED0() digitalWrite(PR1,0)
#define TXLED1() digitalWrite(PR1,1)
#define RXLED0() digitalWrite(PR0,0)
#define RXLED1() digitalWrite(PR0,1)


static const uint8_t A0 = 20;
static const uint8_t A1 = 21;
static const uint8_t A2 = 22;
static const uint8_t A3 = 23;
static const uint8_t A4 = 24;
static const uint8_t A5 = 25;
static const uint8_t A6 = 26;
static const uint8_t A7 = 27;
static const uint8_t A8 = 28;
static const uint8_t A9 = 29;
static const uint8_t A10 = 30;
static const uint8_t A11 = 31; // note that this is PA0, also AREF


// DIGITAL TO ANALOG CONVERTER DACA and DACB
// DACA Output on pins A1 (CH0) and A2 (CH1), DACB on A8 (CH0) and A9 (CH1)

#define DACA_CH0_PIN A1  /* check for #define to determine DACA, DACB support */
#define DACA_CH1_PIN A2
#define DACB_CH0_PIN A8
#define DACB_CH1_PIN A9



// on the xmega128a4u, PA2, PB2, PC2, PD2, and PE2 are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.



#ifdef ARDUINO_MAIN /* I only have memory assignments for these when 'ARDUINO_MAIN' is defined */


const uint16_t PROGMEM port_to_mode_PGM[] =
{
  NOT_A_PORT,             // 0
  (uint16_t) &PORTA_DIR,       // PA
  (uint16_t) &PORTB_DIR,       // PB
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  (uint16_t) &PORTE_DIR,       // PE
  (uint16_t) &PORTR_DIR,       // PR
};

const uint16_t PROGMEM port_to_output_PGM[] =
{
  NOT_A_PORT,              // 0
  (uint16_t) &PORTA_OUT,       // PA
  (uint16_t) &PORTB_OUT,       // PB
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  (uint16_t) &PORTE_OUT,       // PE
  (uint16_t) &PORTR_OUT,       // PR
};

const uint16_t PROGMEM port_to_input_PGM[] =
{
  NOT_A_PORT,             // 0
  (uint16_t) &PORTA_IN,       // PA
  (uint16_t) &PORTB_IN,       // PB
  (uint16_t) &PORTC_IN,       // PC
  (uint16_t) &PORTD_IN,       // PD
  (uint16_t) &PORTE_IN,       // PE
  (uint16_t) &PORTR_IN,       // PR
};

const uint8_t PROGMEM port_to_int0_PGM[] =
{
  NOT_AN_INTERRUPT,           // 0
  PORTA_INT0,                 // PA
  PORTB_INT0,                 // PB
  PORTC_INT0,                 // PC
  PORTD_INT0,                 // PD
  PORTE_INT0,                 // PE
  PORTR_INT0,                 // PR
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTE (PORTF?) support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)

const uint16_t PROGMEM digital_pin_to_control_PGM[] =
{
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 0 **  USARTD0_RX   ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 1 **  USARTD0_TX
  (uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 2 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 3 **

  (uint16_t) &PORTE_PIN2CTRL,  // PE 2 ** 4 **               ASYNC
  (uint16_t) &PORTE_PIN3CTRL,  // PE 3 ** 5 **

  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 6 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 7 **

  (uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 8 **  USARTC0_RX,  ASYNC
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 9 **  USARTC0_TX
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 10 ** SPI_SS
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 11 ** SPI_MOSI
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 12 ** SPI_MISO, USARTC1_RX
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 13 ** SPI_SCK, USARTC1_TX

