XMegaForArduino/arduino/variants/xmega128a4u/pins_arduino.h
#ifdef USE_TWIC
  (uint16_t) &PORTE_PIN0CTRL,  // PE 0 ** 14 ** SDA1
  (uint16_t) &PORTE_PIN1CTRL,  // PE 1 ** 15 ** SCL1
#else
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 14 ** SDA0
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 15 ** SCL0
#endif // USE_TWIC

  (uint16_t) &PORTR_PIN0CTRL,  // PR 0 ** 16 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1 ** 17 ** default LED

#ifdef USE_TWIC
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 18 ** SDA, SDA0
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 19 ** SCL, SCL0
#else
  (uint16_t) &PORTE_PIN0CTRL,  // PE 0 ** 18 ** SDA, SDA1
  (uint16_t) &PORTE_PIN1CTRL,  // PE 1 ** 19 ** SCL, SCL1
#endif // USE_TWIC

  (uint16_t) &PORTA_PIN1CTRL,  // PA 1 ** 20 ** A0
  (uint16_t) &PORTA_PIN2CTRL,  // PA 2 ** 21 ** A1
  (uint16_t) &PORTA_PIN3CTRL,  // PA 3 ** 22 ** A2           ASYNC
  (uint16_t) &PORTA_PIN4CTRL,  // PA 4 ** 23 ** A3
  (uint16_t) &PORTA_PIN5CTRL,  // PA 5 ** 24 ** A4
  (uint16_t) &PORTA_PIN6CTRL,  // PA 6 ** 25 ** A5
  (uint16_t) &PORTA_PIN7CTRL,  // PA 7 ** 26 ** A6
  (uint16_t) &PORTB_PIN0CTRL,  // PB 0 ** 27 ** A7
  (uint16_t) &PORTB_PIN1CTRL,  // PB 1 ** 28 ** A8
  (uint16_t) &PORTB_PIN2CTRL,  // PB 2 ** 29 ** A9
  (uint16_t) &PORTB_PIN3CTRL,  // PB 3 ** 30 ** A10         ASYNC
  (uint16_t) &PORTA_PIN0CTRL,  // PA 0 ** 31 ** A11         AREF
};

// PD2-5 Digital 0-3
// PE2-3 Digital 4-5 (this provides an async interrupt on 4)
// PD0-1 Digital 6-7
// PC2-7 Digital 8-13 (so SPI shows up on 10-13)
// PE0-1 digital 14-15 (for TWIE)
// PR0-1 digital 16-17 (LED on 17)
// PC0-1 digital 18-19 (for TWIC)
// PD6-7 USB D-, D+
// PA0-7 analog A0-A7
// PB0-3 analog A8-A11

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------
  _PD,  // PD 2 ** 0 **  USARTD_RX
  _PD,  // PD 3 ** 1 **  USARTD_TX
  _PD,  // PD 4 ** 2 **
  _PD,  // PD 5 ** 3 **

  _PE,  // PE 2 ** 4 **
  _PE,  // PE 3 ** 5 **

  _PD,  // PD 0 ** 6 **
  _PD,  // PD 1 ** 7 **

  _PC,  // PC 2 ** 8 **  USARTC0_RX
  _PC,  // PC 3 ** 9 **  USARTC0_TX
  _PC,  // PC 4 ** 10 ** SPI_SS
  _PC,  // PC 5 ** 11 ** SPI_MOSI
  _PC,  // PC 6 ** 12 ** SPI_MISO, USARTC1_RX
  _PC,  // PC 7 ** 13 ** SPI_SCK, USARTC1_TX

#ifdef USE_TWIC
  _PE,  // PE 0 ** 14 ** SDA1
  _PE,  // PE 1 ** 15 ** SCL1
#else
  _PC,  // PC 0 ** 14 ** SDA0
  _PC,  // PC 1 ** 15 ** SCL0
#endif // USE_TWIC

  _PR,  // PR 0 ** 16 **
  _PR,  // PR 1 ** 17 ** default LED

#ifdef USE_TWIC
  _PC,  // PC 0 ** 18 ** SDA, SDA0
  _PC,  // PC 1 ** 19 ** SCL, SCL0
#else
  _PD,  // PE 0 ** 18 ** SDA, SDA1
  _PD,  // PE 1 ** 19 ** SCL, SCL1
#endif // USE_TWIC

  _PA,  // PA 1 ** 20 ** A0
  _PA,  // PA 2 ** 21 ** A1
  _PA,  // PA 3 ** 22 ** A2
  _PA,  // PA 4 ** 23 ** A3
  _PA,  // PA 5 ** 24 ** A4
  _PA,  // PA 6 ** 25 ** A5
  _PA,  // PA 7 ** 26 ** A6
  _PB,  // PB 0 ** 27 ** A7
  _PB,  // PB 1 ** 28 ** A8
  _PB,  // PB 2 ** 29 ** A9
  _PB,  // PB 3 ** 30 ** A10
  _PA,  // PA 0 ** 31 ** A11  AREF
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] =
{
  // PIN IN PORT
  // -------------------------------------------
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  _BV( 2 ),  // PD 2 ** 0 **  USARTD_RX
  _BV( 3 ),  // PD 3 ** 1 **  USARTD_TX
  _BV( 4 ),  // PD 4 ** 2 **
  _BV( 5 ),  // PD 5 ** 3 **

  _BV( 2 ),  // PE 2 ** 4 **
  _BV( 3 ),  // PE 3 ** 5 **

  _BV( 0 ),  // PD 0 ** 6 **
  _BV( 1 ),  // PD 1 ** 7 **

  _BV( 2 ),  // PC 2 ** 8 **  USARTC0_RX
  _BV( 3 ),  // PC 3 ** 9 **  USARTC0_TX
  _BV( 4 ),  // PC 4 ** 10 ** SPI_SS
  _BV( 5 ),  // PC 5 ** 11 ** SPI_MOSI
  _BV( 6 ),  // PC 6 ** 12 ** SPI_MISO, USARTC1_RX
  _BV( 7 ),  // PC 7 ** 13 ** SPI_SCK, USARTC1_TX

#ifdef USE_TWIC
  _BV( 0 ),  // PE 0 ** 14 ** SDA1
  _BV( 0 ),  // PE 1 ** 15 ** SCL1
#else
  _BV( 0 ),  // PC 0 ** 14 ** SDA0
  _PV( 0 ),  // PC 1 ** 15 ** SCL0
#endif // USE_TWIC

  _BV( 0 ),  // PR 0 ** 16 **
  _BV( 1 ),  // PR 1 ** 17 ** default LED

#ifdef USE_TWIC
  _BV( 0 ),  // PC 0 ** 18 ** SDA, SDA0
  _BV( 1 ),  // PC 1 ** 19 ** SCL, SCL0
#else
  _BV( 0 ),  // PE 0 ** 18 ** SDA, SDA1
  _BV( 1 ),  // PE 1 ** 19 ** SCL, SCL1
#endif // USE_TWIC

  _BV( 1 ),  // PA 1 ** 20 ** A0
  _BV( 2 ),  // PA 2 ** 21 ** A1
  _BV( 3 ),  // PA 3 ** 22 ** A2
  _BV( 4 ),  // PA 4 ** 23 ** A3
  _BV( 5 ),  // PA 5 ** 24 ** A4
  _BV( 6 ),  // PA 6 ** 25 ** A5
  _BV( 7 ),  // PA 7 ** 26 ** A6
  _BV( 0 ),  // PB 0 ** 27 ** A7
  _BV( 1 ),  // PB 1 ** 28 ** A8
  _BV( 2 ),  // PB 2 ** 29 ** A9
  _BV( 3 ),  // PB 3 ** 30 ** A10
  _BV( 0 ),  // PA 0 ** 31 ** A11  AREF
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] =
{
  // TIMERS
  // -------------------------------------------
  // for now 'NOT_ON_TIMER' for all - later, assign timers based
  // on pins 0-3 being enabled as PWM out for ports A through E
  // corresponding to timers A through D (see D manual sections 11.12.14,
  // also see D manual sect 13.6 for using the 'compare' channel on 'TCx2' to generate
  // a PWM output.  Must select pin as output, _AND_ enable the 'compare' output
  // for the appropriate pin.  LCMPENx/HCMPENx registers to enable it.

// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  TIMERD2,       // PD 2 ** 0 **  USARTD_RX
  TIMERD2,       // PD 3 ** 1 **  USARTD_TX
  TIMERD2,       // PD 4 ** 2 **
  TIMERD2,       // PD 5 ** 3 **

  TIMERE0,       // PE 2 ** 4 **
  TIMERE0,       // PE 3 ** 5 **

  TIMERD2,       // PD 0 ** 6 **
  TIMERD2,       // PD 1 ** 7 **

  TIMERC2,       // PC 2 ** 8 **  USARTC0_RX
  TIMERC2,       // PC 3 ** 9 **  USARTC0_TX
  TIMERC2,       // PC 4 ** 10 ** SPI_SS
  TIMERC2,       // PC 5 ** 11 ** SPI_MOSI
  TIMERC2,       // PC 6 ** 12 ** SPI_MISO, USARTC1_RX
  TIMERC2,       // PC 7 ** 13 ** SPI_SCK, USARTC1_TX

#ifdef USE_TWIC
  TIMERE0,       // PE 0 ** 14 ** SDA1
  TIMERE0,       // PE 1 ** 15 ** SCL1
#else
  TIMERC2,       // PE 0 ** 14 ** SDA0
  TIMERC2,       // PE 1 ** 15 ** SCL0
#endif // USE_TWIC

  NOT_ON_TIMER,  // PR 0 ** 16 **
  NOT_ON_TIMER,  // PR 1 ** 17 ** default LED

