XMegaForArduino/arduino/variants/xmega128a4u/pins_arduino.h
#ifdef USE_TWIC
  TIMERC2,      // PC 0 ** 18 ** SDA, SDA0
  TIMERC2,      // PC 1 ** 19 ** SCL, SCL0
#else
  TIMERE0,      // PE 0 ** 18 ** SDA, SDA1
  TIMERE0,      // PE 1 ** 19 ** SCL, SCL1
#endif // USE_TWIC

  NOT_ON_TIMER,  // PA 1 ** 20 ** A0
  NOT_ON_TIMER,  // PA 2 ** 21 ** A1
  NOT_ON_TIMER,  // PA 3 ** 22 ** A2
  NOT_ON_TIMER,  // PA 4 ** 23 ** A3
  NOT_ON_TIMER,  // PA 5 ** 24 ** A4
  NOT_ON_TIMER,  // PA 6 ** 25 ** A5
  NOT_ON_TIMER,  // PA 7 ** 26 ** A6
  NOT_ON_TIMER,  // PB 0 ** 27 ** A7
  NOT_ON_TIMER,  // PB 1 ** 28 ** A8
  NOT_ON_TIMER,  // PB 2 ** 29 ** A9
  NOT_ON_TIMER,  // PB 3 ** 30 ** A10
  NOT_ON_TIMER,  // PA 0 ** 31 ** A11  AREF
};

#endif


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL     Serial
#define SERIAL_PORT_MONITOR        Serial1
#define SERIAL_PORT_HARDWARE       Serial1
#define SERIAL_PORT_HARDWARE_OPEN  Serial2

#endif


